[
  {
    "date": "June 21, 2017",
    "title": "PG County Executive Rushern Baker will run for governor",
    "author": "Leah Brennan",
    "blurb":
      "Prince George's County Executive Rushern Baker announced Wednesday his run for Maryland governor, challenging Republican Gov. Larry Hogan's bid for a second term alongside two other Democratic candidates.<br /><br />Baker — who touts his successes over corruption, poor economic conditions and high crime rates as county executive in his campaign video — said he plans to make Maryland a place \"that leaves no one behind.\"",
    "link":
      "http://www.dbknews.com/2017/06/22/rushern-baker-maryland-governor-campaign-prince-georges-county/",
    "image": {
      "url": "/assets/race-img-01.jpeg",
      "alt":
        "Prince George's County Executive Rushern Baker. (Photo via Flickr)"
    }
  },
  {
    "date": "September 19, 2017",
    "title":
      "Krish Vignarajah speaks at UMD after kicking off her gubernatorial campaign",
    "author": "Naomi Grant",
    "blurb":
      "Krish Vignarajah, who was a policy adviser to former first lady Michelle Obama, officially launched her gubernatorial campaign Tuesday, including a stop at the University of Maryland's College Democrats meeting.<br /><br />Vignarajah kicked off her campaign with a three-day road trip across Maryland starting Monday and going until Wednesday, according to a news release.",
    "link":
      "http://www.dbknews.com/2017/09/20/krish-vignarajah-campaign-governor-university-of-maryland/",
    "image": {
      "url": "/assets/race-img-02.jpeg",
      "alt":
        "Krish Vignarajah, a Democratic candidate for Maryland governor, speaks at a College Democrats meeting about her campaign in Tydings Hall on Tuesday, Sept. 19, 2017. (Tom Hausman/The Diamondback)"
    }
  },
  {
    "date": "September 27, 2017",
    "title":
      "Democratic gubernatorial candidate Alec Ross visits UMD to help register students to vote",
    "author": "Naomi Grant",
    "blurb":
      "Maryland Democratic gubernatorial candidate Alec Ross visited the University of Maryland on Tuesday, National Voter Registration Day, to help register voters.<br /><br />\"We just want to give the opportunity to more students, and for me, it's an important day, just because of my history doing voter registration in communities of color,\" the tech entrepreneur said. \"Without voting, people are going to be disempowered, so you have to vote. It's not enough to post on social media, it's not enough to march. You have to vote.\"",
    "link":
      "http://www.dbknews.com/2017/09/27/maryland-gubernatorial-candidate-alec-ross-visits-university-of-maryland/",
    "image": {
      "url": "/assets/race-img-03.jpeg",
      "alt":
        "Maryland Democratic gubernatorial candidate Alec Ross (right) and Aaron Gold (left), who works on Ross' campaign, hold a sign at Stamp Student Union on Tuesday, Sept. 26, 2017. (Naomi Grant/For The Diamondback)"
    }
  },
  {
    "date": "October 10, 2017",
    "title":
      "Maryland gubernatorial candidates talk progressivism, minimum wage at Silver Spring forum",
    "author": "Naomi Grant",
    "blurb":
      "Five of the seven Democratic candidates for Maryland's governorship discussed progressivism, minimum wage and campaigning at a forum hosted by Progressive Neighbors in Silver Spring on Monday night.<br /><br />About 100 people attended the event, which included each of the Democratic candidates, except Ben Jealous and Kevin Kamenetz.",
    "link":
      "http://www.dbknews.com/2017/10/10/maryland-gubernatorial-candidates-forum-silver-spring/",
    "image": {
      "url": "/assets/race-img-04.jpeg",
      "alt":
        "Some of Maryland's Democratic gubernatorial candidates speak at a forum in Silver Spring on Monday, Oct. 9, 2017. (Naomi Grant/For The Diamondback)"
    }
  },
  {
    "date": "October 10, 2017",
    "title":
      "Maryland gubernatorial candidate Krish Vignarajah files suit over her eligibility",
    "author": "Naomi Grant",
    "blurb":
      "Maryland Democratic gubernatorial candidate Krishanti Vignarajah filed a legal action suit Friday seeking a decision on whether she's eligible to take part in the race.<br /><br />Vignarajah, who has received questions surrounding her voter registration and residency status, filed her suit with the Anne Arundel County Circuit Court regarding her eligibility to run for governor.",
    "link":
      "http://www.dbknews.com/2017/10/11/maryland-governor-candidate-krish-vignarajah-eligibility/",
    "image": {
      "url": "/assets/race-img-02.jpeg",
      "alt":
        "Krish Vignarajah, a Democratic candidate for Maryland governor, speaks at a College Democrats meeting about her campaign in Tydings Hall on Tuesday, Sept. 19, 2017. (Tom Hausman/The Diamondback)"
    }
  },
  {
    "date": "October 20, 2017",
    "title":
      "Ben Jealous brings his campaign for Maryland governor to Busboys & Poets",
    "author": "Naomi Grant",
    "blurb":
      "One of the reasons Ben Jealous is running for governor is to bring back \"the Maryland dream.\"<br /><br />\"The only thing more powerful than the American dream is the Maryland dream,\" the former NAACP president said. \"We've got to get back to Maryland being the Maryland that brought us here in the first place — the place that we knew where, if we put down roots here, our children could dream a little higher and our families could succeed a little more.\"",
    "link":
      "http://www.dbknews.com/2017/10/20/ben-jealous-governor-busboys-poets/",
    "image": {
      "url": "/assets/race-img-06.jpeg",
      "alt":
        "Democratic gubernatorial candidate Ben Jealous speaks at Busboys and Poets on Oct. 19, 2017."
    }
  },
  {
    "date": "November 13, 2017",
    "title":
      "Maryland gubernatorial candidate proposes plan to combat sexual harassment",
    "author": "Naomi Grant",
    "blurb":
      "Maryland gubernatorial candidate Krish Vignarajah released a plan to combat \"sexual harassment and sexual violence in government, businesses and schools\" on Monday, which includes a proposal for the creation of an Office of Sexual Harassment and Violence. <br /><br />Reporting directly to the governor's office, the proposed office would be responsible for coordinating local, state and federal agencies' efforts in combating sexual harassment and sexual violence, according to a Nov. 13 news release. It would also provide comprehensive services to address survivors' needs by creating technology to flag \"repeat predators,\" encouraging law enforcement to address the backlog of untested rape kits and act quickly on reports of harassment and assault.",
    "link":
      "http://www.dbknews.com/2017/11/14/krish-vignarajah-sexual-harassment-misconduct-maryland-govenor/",
    "image": {
      "url": "/assets/race-img-02.jpeg",
      "alt":
        "Krish Vignarajah, a Democratic candidate for Maryland governor, speaks at a College Democrats meeting about her campaign in Tydings Hall on Tuesday, Sept. 19, 2017. (Tom Hausman/The Diamondback)"
    }
  },
  {
    "date": "November 15, 2017",
    "title":
      "Maryland gubernatorial candidate Rich Madaleno discusses politics at UMD",
    "author": "Naomi Grant",
    "blurb":
      "When Maryland Sen. Rich Madaleno was elected to the state legislature in 2002, he was told being out would destroy his career.<br /><br />An openly gay man had never served in Maryland's legislature before, and it was only in 2001 that the state barred discrimination based on sexual orientation.",
    "link":
      "http://www.dbknews.com/2017/11/15/umd-richard-madaleno-maryland-governor-candidate-larry-hogan-college-democrats-our-revolution/",
    "image": {
      "url": "/assets/race-img-08.jpeg",
      "alt":
        "Maryland State Sen. and gubernatorial candidate Rich Madaleno (D-Montgomery) speaks to the College Democrats and Our Revolution UMD on Tuesday, Nov. 14, 2017, in Tydings Hall. He spoke about his campaign. (Richard Moglen/The Diamondback)"
    }
  },
  {
    "date": "November 20, 2017",
    "title":
      "Maryland gubernatorial candidate Ben Jealous releases plan to combat state’s opioid crisis",
    "author": "Naomi Grant",
    "blurb":
      "Maryland gubernatorial candidate Ben Jealous released a plan Friday to combat the state's ongoing opioid crisis.<br /><br />As governor, the Democrat and former NAACP president said he would work with the attorney general \"to take on the opioid manufacturers whose greed created this crisis and use the settlement money to fund our efforts to end the epidemic,\" according to a news release.",
    "link":
      "http://www.dbknews.com/2017/11/20/maryland-opioid-crisis-ben-jealous-governor-election-plan-larry-hogan/",
    "image": {
      "url": "/assets/race-img-09.jpeg",
      "alt":
        "Maryland gubernatorial candidate and former NAACP president Ben Jealous. (Photo by Gage Skidmore)"
    }
  },
  {
    "date": "December 6, 2017",
    "title":
      "Maryland gubernatorial candidate Ben Jealous discusses healthcare and minimum wage at UMD",
    "author": "Naomi Grant",
    "blurb":
      "Maryland Democratic gubernatorial candidate Ben Jealous outlined his signature plan to improve education by reallocating money spent on mass incarceration, among other proposed policies, at an event hosted by this university's chapters of College Democrats and Our Revolution on Tuesday night.<br /><br />\"The number one way that we will fund greater college affordability is we'll shift our priority,\" Jealous said. \"We'll end the failed war on drugs. It took about two generations to get where we are, it'll take a while to get back to where we need to be. But we have the money, we're just spending it the wrong way.\"",
    "link":
      "http://www.dbknews.com/2017/12/06/ben-jealous-governor-umd-healthcare/",
    "image": {
      "url": "/assets/race-img-10.jpeg",
      "alt":
        "Maryland gubernatorial candidate and former NAACP President Ben Jealous spoke at a College Democrats and Our Revolution UMD event on Tuesday, Dec. 5, 2017. (Richard Moglen/The Diamondback)"
    }
  },
  {
    "date": "April 3, 2018",
    "title":
      "Maryland gubernatorial hopeful Alec Ross talks transportation and technology at UMD event",
    "author": "Brooks DuBose",
    "blurb":
      "Author and tech entrepreneur Alec Ross, a Democratic Maryland gubernatorial candidate, laid out his vision for the state — including his differences with Gov. Larry Hogan on transportation and marijuana legalization, and combating the opioid epidemic — in Tydings Hall at the University of Maryland on Monday night.<br /><br />Ross, 46, spoke as part of the College Democrats-hosted speaker series. Other speakers in the series have included fellow Democratic gubernatorial candidates including former NAACP president Ben Jealous, state Sen. Rich Madaleno (D-Montgomery) and lieutenant governor candidate Valerie Ervin.",
    "link":
      "http://www.dbknews.com/2018/04/03/alec-ross-maryland-governor-candidate-umd/",
    "image": {
      "url": "/assets/race-img-03.jpeg",
      "alt":
        "Maryland Democratic gubernatorial candidate Alec Ross (right) and Aaron Gold (left), who works on Ross' campaign, hold a sign at Stamp Student Union on Tuesday, Sept. 26, 2017. (Naomi Grant/For The Diamondback)"
    }
  },
  {
    "date": "April 26, 2018",
    "title":
      "Maryland Democratic gubernatorial candidates hold forum in Glenn Dale",
    "author": "Brooks DuBose",
    "blurb":
      "Eight Democratic gubernatorial candidates aiming to unseat Gov. Larry Hogan in November discussed a broad range of topics including climate change, education, transportation, gun control and their dislike for the Republican governor at a forum in Glenn Dale on Wednesday night.<br /><br />The candidates fielded questions for about two hours before a crowd of more than 200 attendees at the Reid Temple AME Church.",
    "link":
      "http://www.dbknews.com/2018/04/26/maryland-gubernatorial-forum-democratic-candidates-election/",
    "image": {
      "url": "/assets/race-img-12.jpeg",
      "alt":
        "Eight Democratic gubernatorial candidates took part in a forum in Glenn Dale on Wednesday, April 25, 2018. (Brooks DuBose/For The Diamondback)"
    }
  },
  {
    "date": "April 30, 2018",
    "title":
      "Richard Madaleno is the first Maryland gubernatorial candidate to release tax returns",
    "author": "Brooks DuBose",
    "blurb":
      "Democratic gubernatorial candidate and state Sen. Rich Madaleno (D-Montgomery) released his tax returns from the previous six years last week and called on his opponents — including Gov. Larry Hogan — to do the same.<br /><br />The move was intended to set a standard of transparency broken by President Donald Trump, said Madaleno, who has spent over a decade in the Maryland General Assembly.",
    "link":
      "http://www.dbknews.com/2018/04/30/madaleno-release-gubernatorial-tax-returns/",
    "image": {
      "url": "/assets/race-img-08.jpeg",
      "alt":
        "Maryland State Sen. and gubernatorial candidate Rich Madaleno (D-Montgomery) speaks to the College Democrats and Our Revolution UMD on Tuesday, Nov. 14, 2017, in Tydings Hall. He spoke about his campaign. (Richard Moglen/The Diamondback)"
    }
  },
  {
    "date": "May 2, 2018",
    "title":
      "Not all Democrats running to be Maryland governor support legalizing marijuana. Here’s why.",
    "author": "Brooks DuBose",
    "blurb":
      "Legalizing marijuana is high on the list of priorities for most of the Maryland Democratic gubernatorial candidates, but the two county executives in the race are less eager in their support than their opponents.<br /><br />Prince George's County Executive Rushern Baker and Baltimore County Executive Kevin Kamenetz have each stopped short of fully endorsing legalization, even though it has significant support statewide — especially among Democrats.",
    "link":
      "http://www.dbknews.com/2018/05/03/marijuana-weed-legalization-maryland-governor-rushern-baker-kevin-kamenetz/",
    "image": {
      "url": "/assets/race-img-14.jpeg",
      "alt":
        "Rushern Baker, pictured here addressing Immigration Forum attendees at Stamp Student Union on Sept. 24, said he is not in favor of legalizing marijuana unless it's accompanied by other measures. (Evan Kramer/ the Diamondback)"
    }
  }
]
